## Series

In [55]:
import pandas as pd
import numpy as np

In [56]:
labels = ['a', 'b', 'c']

minha_lista = [10, 20, 30]

arr = np.array([10, 20, 30])

d = {'a':10, 'b':20, 'c':30}

In [57]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [58]:
pd.Series(data=labels, index=minha_lista)

10    a
20    b
30    c
dtype: object

In [59]:
pd.Series(labels, minha_lista)

10    a
20    b
30    c
dtype: object

In [60]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [61]:
ser1 = pd.Series([1, 2, 3, 4], index = ['EUA', 'Alemanha', 'Rússia', 'Japão'])

In [62]:
ser1

EUA         1
Alemanha    2
Rússia      3
Japão       4
dtype: int64

In [63]:
ser2 = pd.Series([1, 2, 5, 4], index = ['EUA', 'Alemanha', 'Itália', 'Japão'])

In [64]:
ser2

EUA         1
Alemanha    2
Itália      5
Japão       4
dtype: int64

In [65]:
ser1[['EUA', 'Alemanha', 'Rússia']]

EUA         1
Alemanha    2
Rússia      3
dtype: int64

In [66]:
ser1 + ser2

Alemanha    4.0
EUA         2.0
Itália      NaN
Japão       8.0
Rússia      NaN
dtype: float64

## DataFrames

In [67]:
from numpy.random import randn

In [68]:
df = pd.DataFrame(randn(5,4), index= ["A", "B", "C", "D", "E"], columns="W X Y Z".split())

In [69]:
df

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826
C -0.607558  0.186548 -0.261075 -0.126447
D  0.997645 -1.344346  0.479573  0.445665
E  0.890700  0.914807 -1.804116  0.815858

In [70]:
type(df)

pandas.core.frame.DataFrame

In [71]:
df[['W']]

          W
A -0.022274
B -1.391072
C -0.607558
D  0.997645
E  0.890700

In [72]:
df['new'] = df['W'] + df['X']

df

In [74]:
df2 = df.drop('new', axis=1)

In [75]:
df

          W         X         Y         Z       new
A -0.022274 -0.750704  1.565279 -0.906719 -0.772978
B -1.391072 -0.497202 -0.433315 -0.008826 -1.888274
C -0.607558  0.186548 -0.261075 -0.126447 -0.421010
D  0.997645 -1.344346  0.479573  0.445665 -0.346701
E  0.890700  0.914807 -1.804116  0.815858  1.805507

In [76]:
df2

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826
C -0.607558  0.186548 -0.261075 -0.126447
D  0.997645 -1.344346  0.479573  0.445665
E  0.890700  0.914807 -1.804116  0.815858

In [77]:
df.drop('new', axis=1, inplace=True)

In [78]:
df

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826
C -0.607558  0.186548 -0.261075 -0.126447
D  0.997645 -1.344346  0.479573  0.445665
E  0.890700  0.914807 -1.804116  0.815858

In [79]:
df.loc[['A', 'B']]

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826

In [80]:
df.loc[['A', 'B']]

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826

In [81]:
df

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826
C -0.607558  0.186548 -0.261075 -0.126447
D  0.997645 -1.344346  0.479573  0.445665
E  0.890700  0.914807 -1.804116  0.815858

In [82]:
df.iloc[:-1, 1:4]

          X         Y         Z
A -0.750704  1.565279 -0.906719
B -0.497202 -0.433315 -0.008826
C  0.186548 -0.261075 -0.126447
D -1.344346  0.479573  0.445665

In [83]:
df.iloc[1:3, 2:]

          Y         Z
B -0.433315 -0.008826
C -0.261075 -0.126447

In [84]:
df

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826
C -0.607558  0.186548 -0.261075 -0.126447
D  0.997645 -1.344346  0.479573  0.445665
E  0.890700  0.914807 -1.804116  0.815858

In [85]:
df > 0

       W      X      Y      Z
A  False  False   True  False
B  False  False  False  False
C  False   True  False  False
D   True  False   True   True
E   True   True  False   True

In [86]:
df[df > 0]

          W         X         Y         Z
A       NaN       NaN  1.565279       NaN
B       NaN       NaN       NaN       NaN
C       NaN  0.186548       NaN       NaN
D  0.997645       NaN  0.479573  0.445665
E  0.890700  0.914807       NaN  0.815858

In [87]:
df['Y'] > 0

A     True
B    False
C    False
D     True
E    False
Name: Y, dtype: bool

In [88]:
df[df['Y'] > 0]

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
D  0.997645 -1.344346  0.479573  0.445665

In [89]:
df[(df['Y'] > 0) & (df['Z'] > 0)]

          W         X         Y         Z
D  0.997645 -1.344346  0.479573  0.445665

## Mais detalhes do Índice

In [90]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [91]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [92]:
df

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826
C -0.607558  0.186548 -0.261075 -0.126447
D  0.997645 -1.344346  0.479573  0.445665
E  0.890700  0.914807 -1.804116  0.815858

In [93]:
df.reset_index(inplace=True)

In [94]:
df

  index         W         X         Y         Z
0     A -0.022274 -0.750704  1.565279 -0.906719
1     B -1.391072 -0.497202 -0.433315 -0.008826
2     C -0.607558  0.186548 -0.261075 -0.126447
3     D  0.997645 -1.344346  0.479573  0.445665
4     E  0.890700  0.914807 -1.804116  0.815858

In [95]:
df.set_index("index", inplace=True)

In [96]:
df

              W         X         Y         Z
index
A     -0.022274 -0.750704  1.565279 -0.906719
B     -1.391072 -0.497202 -0.433315 -0.008826
C     -0.607558  0.186548 -0.261075 -0.126447
D      0.997645 -1.344346  0.479573  0.445665
E      0.890700  0.914807 -1.804116  0.815858

In [97]:
tabela = pd.DataFrame(randn(3, 6), index = "D M G".split(), columns = "G U E R R A".split())

In [98]:
tabela

          G         U         E         R         R         A
D  0.390975 -0.282203  0.849051  0.576523  0.300568  0.958332
M -1.060492 -0.790290  1.518789 -0.474171 -0.751637 -0.278104
G -1.161083 -0.693901 -0.492290  1.372292  0.163729  1.008287

In [99]:
tabela.iloc[1:, 1:4]

          U         E         R
M -0.790290  1.518789 -0.474171
G -0.693901 -0.492290  1.372292

## Hierarquia de Índices e Índices múltiplos

In [100]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [101]:
inside = [1, 2, 3, 1, 2, 3]

In [102]:
hier_index = list(zip(outside, inside))

In [103]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [104]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [105]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [106]:
df = pd.DataFrame(np.random.randn(6, 2), index = hier_index, columns = ['A', 'B'])

In [107]:
df

             A         B
G1 1 -0.864758 -0.547972
   2  0.878554 -0.005577
   3 -0.399708  0.546921
G2 1 -2.101930  0.884277
   2 -0.582534 -0.854851
   3 -0.876803  1.012394

In [110]:
df.loc['G1'].loc[[1]]

          A         B
1 -0.864758 -0.547972

In [111]:
df.index.names = ['Grupo', 'Número']

In [112]:
df

                     A         B
Grupo Número
G1    1      -0.864758 -0.547972
      2       0.878554 -0.005577
      3      -0.399708  0.546921
G2    1      -2.101930  0.884277
      2      -0.582534 -0.854851
      3      -0.876803  1.012394

In [113]:
df.xs(1, level = 'Número')

              A         B
Grupo
G1    -0.864758 -0.547972
G2    -2.101930  0.884277

## Manipulação de dados ausentes

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'A': [1, 2, np.nan],
                   'B': [5, np.nan, np.nan],
                   'C': [1, 2, 3]})

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.dropna(axis=1, thresh = 2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [7]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [9]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [10]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [11]:
df.ffill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

## Groupby

In [18]:
import pandas as pd
data = {'Classe': ['Júnior', 'Júnior', 'Pleno', 'Pleno', 'Sênior', 'Sênior'],
        'Nome': ['Jorge', 'Carlos', 'Roberta', 'Patrícia', 'Bruno', 'Vera'],
        'Venda':[200, 120, 340, 124, 243, 350]}

In [41]:
df = pd.DataFrame(data)

In [20]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [22]:
group = df.groupby("Classe")

In [25]:
group.sum()

                   Nome  Venda
Classe
Júnior      JorgeCarlos    320
Pleno   RobertaPatrícia    464
Sênior        BrunoVera    593

In [34]:
df.groupby('Classe').min()

            Nome  Venda
Classe
Júnior    Carlos    120
Pleno   Patrícia    124
Sênior     Bruno    243

In [35]:
df.groupby('Classe').max()

           Nome  Venda
Classe
Júnior    Jorge    200
Pleno   Roberta    340
Sênior     Vera    350

In [44]:
df2 = df.copy()

In [45]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [46]:
df2['Venda'] = [150, 432, 190, 230, 410, 155]

In [47]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [48]:
df2

   Classe      Nome  Venda
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [50]:
df3 = pd.concat([df, df2])

In [52]:
df3.groupby(['Classe', 'Nome']).sum()

                 Venda
Classe Nome
Júnior Carlos      552
       Jorge       350
Pleno  Patrícia    354
       Roberta     530
Sênior Bruno       653
       Vera        505

## Merge, concat e Join

In [2]:
import pandas as pd
import numpy as np
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [3]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [4]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [5]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [6]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [7]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [8]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [9]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [10]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [11]:
pd.merge(esquerda, direita, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [12]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [14]:
pd.merge(esquerda, direita, how ="outer", on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

In [15]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [16]:
esquerda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [17]:
direita

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [18]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [20]:
direita.join(esquerda, how='outer')

      C    D    A    B
K0   C0   D0   A0   B0
K1  NaN  NaN   A1   B1
K2   C2   D2   A2   B2
K3   C3   D3  NaN  NaN

## Operações no Pandas

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [3]:
df.memory_usage()

Index    132
col1      32
col2      32
col3      32
dtype: int64

In [5]:
df['col2'].unique()

array([444, 555, 666])

In [6]:
df['col2'].nunique()

3

In [9]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

## Aplicando funções

In [11]:
def comp(x):
    return x ** 2 + 3

In [13]:
df['col1_calc'] = df['col1'].apply(comp)

In [14]:
df

   col1  col2 col3  col1_calc
0     1   444  abc          4
1     2   555  def          7
2     3   666  ghi         12
3     4   444  xyz         19

In [15]:
df['col1_calc'] = df['col1'].apply(lambda x: x ** 2 + 3)

In [16]:
df

   col1  col2 col3  col1_calc
0     1   444  abc          4
1     2   555  def          7
2     3   666  ghi         12
3     4   444  xyz         19

In [17]:
df['col1'].sum()

np.int64(10)

In [18]:
df['col1'].mean()

np.float64(2.5)

In [19]:
df['col1'].product()

np.int64(24)

In [20]:
df['col1'].std()

np.float64(1.2909944487358056)

In [21]:
df['col1'].max()

np.int64(4)

In [22]:
df['col1'].min()

np.int64(1)

In [23]:
df['col1'].idxmax()

3

In [24]:
df

   col1  col2 col3  col1_calc
0     1   444  abc          4
1     2   555  def          7
2     3   666  ghi         12
3     4   444  xyz         19

In [25]:
df[df['col2'] == 444]['col1'].sum()

np.int64(5)

In [26]:
df.sort_values(by='col2')

   col1  col2 col3  col1_calc
0     1   444  abc          4
3     4   444  xyz         19
1     2   555  def          7
2     3   666  ghi         12

In [27]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [29]:
dict_map = {'one': '1', 'two': '2'}

In [30]:
df['E'] = df['B'].map(dict_map)

In [31]:
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [34]:
df.pivot_table(index = 'A', columns = 'B', values = 'D')

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0

## Dados temporais

In [35]:
numero_de_dias = 100

In [36]:
datas = pd.date_range(start='1/1/2021', periods=numero_de_dias)

In [37]:
datas

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31', '2021-02-01',
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-06', '2021-02-07', '2021-02-08', '2021-02-09',
               '2021-02-10', '2021-02-11', '2021-02-12', '2021-02-13',
               '2021-02-14', '2021-02-15', '2021-02-16', '2021-02-17',
               '2021-02-18', '2021-02-19', '2021-02-20', '2021-02-21',
               '2021-02-22', '2021-02-23', '2021-02-24', '2021-02-25',
               '2021-02-26', '2021-02-27', '2021-02-28', '2021-03-01',
               '2021-03-02', '2021-03-03', '2021-03-04', '2021-03-05',
               '2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21',
               '2021-03-22', '2021-03-23', '2021-03-24', '2021-03-25',
               '2021-03-26', '2021-03-27', '2021-03-28', '2021-03-29',
               '2021-03-30', '2021-03-31', '2021-04-01', '2021-04-02',
               '2021-04-03', '2021-04-04', '2021-04-05', '2021-04-06',
               '2021-04-07', '2021-04-08', '2021-04-09', '2021-04-10'],
              dtype='datetime64[ns]', freq='D')

In [38]:
df = pd.DataFrame(range(numero_de_dias), columns=['number'], index=datas)

In [39]:
df

            number
2021-01-01       0
2021-01-02       1
2021-01-03       2
2021-01-04       3
2021-01-05       4
...            ...
2021-04-06      95
2021-04-07      96
2021-04-08      97
2021-04-09      98
2021-04-10      99

[100 rows x 1 columns]

In [40]:
df.index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31', '2021-02-01',
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-06', '2021-02-07', '2021-02-08', '2021-02-09',
               '2021-02-10', '2021-02-11', '2021-02-12', '2021-02-13',
               '2021-02-14', '2021-02-15', '2021-02-16', '2021-02-17',
               '2021-02-18', '2021-02-19', '2021-02-20', '2021-02-21',
               '2021-02-22', '2021-02-23', '2021-02-24', '2021-02-25',
               '2021-02-26', '2021-02-27', '2021-02-28', '2021-03-01',
               '2021-03-02', '2021-03-03', '2021-03-04', '2021-03-05',
               '2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21',
               '2021-03-22', '2021-03-23', '2021-03-24', '2021-03-25',
               '2021-03-26', '2021-03-27', '2021-03-28', '2021-03-29',
               '2021-03-30', '2021-03-31', '2021-04-01', '2021-04-02',
               '2021-04-03', '2021-04-04', '2021-04-05', '2021-04-06',
               '2021-04-07', '2021-04-08', '2021-04-09', '2021-04-10'],
              dtype='datetime64[ns]', freq='D')

In [43]:
df.index[0]

Timestamp('2021-01-01 00:00:00')

In [44]:
df.index[0].day

1

In [45]:
df.index[0].month

1

In [46]:
df.index[0].year

2021

In [47]:
df.index[0].hour

0

In [50]:
df[df.index.day==10]

            number
2021-01-10       9
2021-02-10      40
2021-03-10      68
2021-04-10      99

In [51]:
df['Month'] = df.index.month

In [52]:
df

            number  Month
2021-01-01       0      1
2021-01-02       1      1
2021-01-03       2      1
2021-01-04       3      1
2021-01-05       4      1
...            ...    ...
2021-04-06      95      4
2021-04-07      96      4
2021-04-08      97      4
2021-04-09      98      4
2021-04-10      99      4

[100 rows x 2 columns]

In [53]:
import datetime

In [54]:
df[df.index > datetime.datetime(2021, 1, 10)]

            number  Month
2021-01-11      10      1
2021-01-12      11      1
2021-01-13      12      1
2021-01-14      13      1
2021-01-15      14      1
...            ...    ...
2021-04-06      95      4
2021-04-07      96      4
2021-04-08      97      4
2021-04-09      98      4
2021-04-10      99      4

[90 rows x 2 columns]